# 猜歌曲库，自己随便加
# "歌曲名": ["提示1", "提示2", "提示3", ["别名1", "别名2"]

pp = "这首歌的p主是"
ss = "这首歌的演唱者为"
xx = "这首歌的部分歌词："

SONG_POOL = {
    "うそつきマカロン（说谎马卡龙）": [
        pp + "暴饮暴食p",
        ss + "重音テト，曲绘常被作为oc描改手书",
        "这首歌高潮部分因用不同国家语言说我爱你而爆火",
        ["说谎马卡龙", "撒谎马卡龙", "马卡龙"],
    ],
    "熱異常": [
        pp + "いよわ（胃弱）",
        ss + "足立レイ（足立零），舞萌收录为紫12白13+",
        "啤酒烧烤也收录了该歌曲，曲绘给人炽热的感觉，被调侃该歌名的反义词为冷正常",
        ["热异常", "熱異常"],
    ],
    "限りなく灰色へ（向着无限的灰色）": [
        pp + "すりぃ",
        ss + "镜音铃/25时全员",
        "啤酒烧烤作为25时曲目，与东云绘名有关",
        ["无限灰", "向着无限的灰色"],
    ],
    "イガク（医学）": [pp + "原口沙輔", ss + "重音テト", "我有ユユ症", ["医学"]],
    "ノンブレス・オブリージュ（无呼吸义务）": [
        pp + "ピノキオピー（枇杷油）",
        "心理委员我喘不上气",
        xx
        + """息が詰まる息が詰まる息が詰まる
           呼吸困难呼吸困难呼吸困难
           息が詰まる息が詰まる息が詰まる
           呼吸困难呼吸困难呼吸困难
           息が詰まる息が詰まる息が詰まる
           呼吸困难呼吸困难呼吸困难
           息が詰まる息が詰まる息が詰ま""",
        ["医学"],
    ],
    "T氏の話を信じるな（不要相信T氏的话）": [
        pp + "ピノキオピー（枇杷油）",
        ss + "初音ミク/重音テト，神秘红色邪教",
        xx
        + """ねえ知ってる？
           呐 你知道吗？
           コスパがいいから魂を売って優勝　へえ
           卖掉灵魂来夺得胜利性价比很高哦 诶~
           よしよし　僕の教えに従順な君を愛してあげるよ
           乖哦乖哦 我会好好疼爱听话顺从的你哦
           へえ　そうなんだ〜　好きになっちゃう
           诶~ 原来如此 有点喜欢上你了
           T氏にすべてを捧げましょう
           把一切都献给T氏吧！""",
        ["不要相信T氏的话"],
    ],
    "I Can't Wait(我无法等待）": [
        pp + "d0tc0mmie",
        ss + "GUMI（咕咪），英文术曲，在近期爆火",
        "这首歌mv的场景在电梯中",
        ["我无法等待"],
    ],
    "ウミユリ海底譚（海百合海底谭）": [
        pp + "n-buna",
        ss + "初音ミク，舞萌定级13，被誉为错位入门曲",
        "",
        ["海底谭", "海百合海底谭", "ウミユリ海底譚"],
    ],
    "うたくめい M（匿名M)": [
        pp + "ピノキオピー(枇杷油），封面配色红蓝",
        ss + "初音ミク和ARuFa，在舞萌被收录为12+",
        "这首歌在曲绘中给人物眼睛打上了神秘黑色马赛克条",
        ["匿名M", "匿名m"],
    ],
    "ツギハギスタッカート（拼凑的断音）": [
        pp + "とあ（toa)",
        ss + "初音ミク，旋律轻快的老歌，曲绘为纯白背景，舞萌定级紫12+",
        xx
        + """君よ いっそいっそ 居なくなれ
        你呀 干脆 干脆 消失掉吧
        変わらない このままなら
        若是如此 永不改变的话
        たぶん きっときっと なんてことない
        大概 一定 一定 并非什么要紧事来的
        少し軽くなるだけ
        只是稍微变得轻松一点而已""",
        ["匿名M", "匿名m"],
    ],
    "ラグトレイン（延误列车）": [
        pp + "稲葉曇",
        ss + "歌愛ユキ(歌爱雪)",
        "已经被舞萌收录，定级为13，无白谱，曲绘场景为整体风格偏灰的电车内",
        ["延误列车"],
    ],
    "春嵐": [
        pp + "john",
        ss + "初音ミク，舞萌定级13没有白谱",
        "曲绘为纯黄色背景和黑色人物以及蓝色玫瑰",
        ["春岚"],
    ],
    "妄想感傷代償連盟": [
        pp + "DECO*27",
        ss + "初音ミク，被舞萌收录为紫11+白13",
        "歌曲名是8个字",
        ["妄想感伤代偿联盟"],
    ],
    "ちっちゃな私（小小的我）": [
        pp + "マサラダ",
        ss + "重音テト,曲名为四个字,歌曲副歌为双人问答形式",
        xx
        + """消えたい？
        想消失？
        消えたい
        想消失
        そっか
        这样啊
        そうなのよ
        是这样的啊""",
        ["小小的我"],
    ],
    "幸せになれる隠しコマンドがあるらしい（似乎有着能变得幸福的隐藏指令）": [
        pp + "うたたP（和幸福安心委员会同p主）",
        ss + "結月ゆかり（结月缘），舞萌收录为红12+紫14",
        "→↓↑→→，↑↑↓↓←→←→",
        [
            "幸福隐藏指令",
            "幸隐",
            "似乎有着能变得幸福的隐藏指令",
            "幸せになれる隠しコマンドがあるらしい",
        ],
    ],
    "KING（王）": [
        pp + "kanaria（烤牛肉）",
        ss + "GUMI，曲绘为红色背景",
        "曲绘手扣牙，舞萌收录原12+现已升为13",
        ["King", "king", "KING", "王"],
    ],
    "強風オールバック(强风大背头）": [
        pp + "ゆこぴ（Yukopi）",
        ss + "歌愛ユキ（歌爱雪），被舞萌和啤酒烧烤收录",
        "黄色背景和超级强风",
        ["强风大背头"],
    ],
    "目撃！テト31世（目击！teto31世）": [
        pp + "はろける（ODD）",
        ss + "重音テト/雨衣",
        xx
        + """PARTY PARTY PARTY PARTY
        派对 派对 派对 派对
        Today is the 31st (トゥデイズ　ザ　サーティーファースト)
        今天31号
        PUMPKIN PUMPKIN PUMPKIN PUMKIN
        南瓜 南瓜 南瓜 南瓜
        Teto is 31(テト　イズ　サーティーワン)
        Teto31岁""",
        ["强风大背头"],
    ],
    "星界ちゃんと可不ちゃんのおつかい合騒曲(星界可不的采购合奏曲）": [
        pp + "南ノ南",
        ss + "星界/可不，BPM高达220",
        "舞萌收录曲，红谱定数11+紫谱13+，猫抓板配置",
        ["星界可不", "星界可不合骚曲", "星界酱和可不酱的采购合奏曲"],
    ],
    "チーズ(芝士）": [
        pp + "Chinozo",
        ss + "KAFU(可不），歌名为两字",
        "黄色背景",
        ["芝士", "Cheese"],
    ],
    "混沌ブギ（混沌布吉）": [
        pp + "jon-YAKITORY",
        ss + "初音ミク，啤酒烧烤已收录为ws团的歌曲",
        xx
        + """純情？なにそれ 愛情？なにそれ
        纯情？那是什么  爱情？又是什么
        美味しいの？ねぇ
        很好吃吗？
        美味しいのって なあ
        真好吃呢
        混沌ブギウギ ハッピー特盛
        混沌的Boogie woogie happy的特盛
        ドンビーシャイだ ドンビーシャイだもう
        咚咚好玩儿，咚咚好玩儿""",
        ["混沌布吉", "混沌ブギ"],
    ],
    "命に嫌われている。（被生命所嫌弃着）": [
        pp + "カンザキイオリ（黑柿子）",
        ss + "初音ミク",
        "被啤酒烧烤收录作为25时的歌曲，舞萌定级为12+",
        ["命嫌", "被生命所厌恶", "被生命所嫌弃着"],
    ],
    "1000年生きてる（存活千年）": [
        pp + "いよわ（胃弱）",
        ss + "初音ミク，舞萌收录13，星星歌",
        xx
        + """狂ったフリでごまかしていこうぜ"
        假装发狂    就这样敷衍了事吧
        骨残らぬパパママよ
        不留残骸的爸爸妈妈啊
        ラッタッタ口ずさんだ歌の名を知りたくて
        我只是想知道那首「啦哒哒」地哼唱着的曲子的名字""",
        ["存活千年", "活了一千年", "存活1000年"],
    ],
    "神っぽいな（像神一样呐）": [
        pp + "ピノキオピー（枇杷油）",
        ss + "初音ミク，空耳：嘟嘟嘟嘟露黑，舞萌收录为白13",
        "修女抽烟",
        ["像神一样", "像神一样呐", "神っぽいな"],
    ],
    "病名は愛だった（病名为爱）": [
        pp + "Neru（押入れP）,曲名为四字",
        ss + "鏡音レン（连）/鏡音リン（铃）",
        """この心に穴が空いたくらいなのに
        明明这颗心已经空空如也
        たったそれだけの違いなのに
        明明只有这点差别
        貴方の背中に滲んでく涙痕が
        渗透进你脊背的泪痕
        枯れそうもないのはどうしてなの
        为什么丝毫不见干涸呢""",
        ["病名为爱"],
    ],
    "少女A": [
        pp + "椎名もた",
        ss + "鏡音リン（镜音铃），曲绘背景为蓝色",
        xx
        + """ああ
           啊啊
           「時に 時に 躓いたって、」
           「有时 有时 摔了一跤、」
           寒い寒い寒い寒い寒い
           好冷 好冷 好冷 好冷 好冷
           寒い寒い寒い寒い寒い
           好冷 好冷 好冷 好冷 好冷""",
        ["少女a"],
    ],
    "太陽系デスコ（太阳系disco）": [
        pp + "ナユタン星人（奶油糖）",
        "该歌曲是红底中爆火的歌曲之一，上过周榜",
        xx
        + """あの一等星のさんざめく光で
           那颗一等星正在放着喧嚣的光芒
           あなたとダンスを踊ろうか
           我们一起来跳舞怎么样
           我が太陽系の法則に誘われ
           我被太阳系的引力所捕获
           交わった感度で綺羅めいて、星ッ！
           相互照耀，闪耀起光芒！""",
        ["太阳系", "太阳系disco", "太陽系デスコ"],
    ],
}
